In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('Electric Vehicle Sales by State in India.csv')
df.head()

,Year,Month_Name,Date,State,Vehicle_Class,Vehicle_Category,Vehicle_Type,EV_Sales_Quantity
0,2014.0,jan,1/1/2014,Andhra Pradesh,ADAPTED VEHICLE,Others,Others,0.0
1,2014.0,jan,1/1/2014,Andhra Pradesh,AGRICULTURAL TRACTOR,Others,Others,0.0
2,2014.0,jan,1/1/2014,Andhra Pradesh,AMBULANCE,Others,Others,0.0
3,2014.0,jan,1/1/2014,Andhra Pradesh,ARTICULATED VEHICLE,Others,Others,0.0
4,2014.0,jan,1/1/2014,Andhra Pradesh,BUS,Bus,Bus,0.0

In [3]:
df.describe()

               Year  EV_Sales_Quantity
count  96845.000000       96845.000000
mean    2018.622768          37.108896
std        2.895581         431.566675
min     2014.000000           0.000000
25%     2016.000000           0.000000
50%     2019.000000           0.000000
75%     2021.000000           0.000000
max     2024.000000       20584.000000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96845 entries, 0 to 96844
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Year               96845 non-null  float64
 1   Month_Name         96845 non-null  object
 2   Date               96845 non-null  object
 3   State              96845 non-null  object
 4   Vehicle_Class      96845 non-null  object
 5   Vehicle_Category   96845 non-null  object
 6   Vehicle_Type       96845 non-null  object
 7   EV_Sales_Quantity  96845 non-null  float64
dtypes: float64(2), object(6)
memory usage: 5.9+ MB

In [5]:
# Strip whitespace from column names
df.columns = df.columns.str.strip().str.replace(" ", "_")

In [6]:
# Standardize object/string columns by trimming whitespace
str_cols = df.select_dtypes(include="object").columns
df[str_cols] = df[str_cols].apply(lambda col: col.str.strip())

In [7]:
# Check missing values
missing = df.isnull().sum()
print("Missing Values:\n", missing)

Missing Values:
 Year                 0
Month_Name           0
Date                 0
State                0
Vehicle_Class        0
Vehicle_Category     0
Vehicle_Type         0
EV_Sales_Quantity    0
dtype: int64

In [8]:
df['Vehicle_Type'].value_counts()

Vehicle_Type
Others                54423
2W_Personal           11700
Bus                    7026
4W_Shared              4580
4W_Personal            4111
3W_Shared              3786
3W_Goods               3208
Institution Bus        2093
3W_Shared_LowSpeed     1951
3W_Goods_LowSpeed      1517
2W_Shared              1421
3W_Personal            1029
Name: count, dtype: int64

In [9]:
df['Vehicle_Category'].value_counts()

Vehicle_Category
Others        54423
2-Wheelers    13121
3-Wheelers    11491
Bus            9119
4-Wheelers     8691
Name: count, dtype: int64

In [10]:
df["Year"] = df["Year"].fillna(0).astype(int)

In [11]:
month_map = {
    'jan': '01', 'feb': '02', 'mar': '03', 'apr': '04',
    'may': '05', 'jun': '06', 'jul': '07', 'aug': '08',
    'sep': '09', 'oct': '10', 'nov': '11', 'dec': '12'
}

df["Month"] = df["Month_Name"].str.lower().map(month_map)

In [12]:
df["Date"] = (
    df["Year"].astype(str) + "-" + df["Month_Name"].astype(str) + "-01"
)

df["Date"] = pd.to_datetime(df["Date"], errors="coerce")

C:\Users\subhr\AppData\Local\Temp\ipykernel_12428\3697593197.py:5: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df["Date"] = pd.to_datetime(df["Date"], errors="coerce")

In [13]:
df["State"] = df["State"].str.title().str.strip()

In [14]:
cat_cols = ["Vehicle_Class", "Vehicle_Category", "Vehicle_Type"]
for col in cat_cols:
    df[col] = df[col].str.title().str.strip()

In [15]:
df["EV_Sales_Quantity"] = (
    df["EV_Sales_Quantity"]
    .astype(str)
    .str.replace(",", "", regex=False)
)

df["EV_Sales_Quantity"] = pd.to_numeric(
    df["EV_Sales_Quantity"],
    errors="coerce"
).fillna(0).astype(int)

In [16]:
df.drop_duplicates(inplace=True)

In [17]:
df = df.drop('Month_Name', axis=1)

In [18]:
df.head()

,Year,Date,State,Vehicle_Class,Vehicle_Category,Vehicle_Type,EV_Sales_Quantity,Month
0,2014,2014-01-01,Andhra Pradesh,Adapted Vehicle,Others,Others,0,01
1,2014,2014-01-01,Andhra Pradesh,Agricultural Tractor,Others,Others,0,01
2,2014,2014-01-01,Andhra Pradesh,Ambulance,Others,Others,0,01
3,2014,2014-01-01,Andhra Pradesh,Articulated Vehicle,Others,Others,0,01
4,2014,2014-01-01,Andhra Pradesh,Bus,Bus,Bus,0,01

In [19]:
print("\nRows:", len(df))
print("Date Range:", df["Date"].min(), "to", df["Date"].max())
print("Unique States:", df["State"].nunique())
print("Sample:")
print(df.head())

Rows: 96845
Date Range: 2014-01-01 00:00:00 to 2024-01-01 00:00:00
Unique States: 34
Sample:
   Year       Date           State         Vehicle_Class Vehicle_Category  \
0  2014 2014-01-01  Andhra Pradesh       Adapted Vehicle           Others
1  2014 2014-01-01  Andhra Pradesh  Agricultural Tractor           Others
2  2014 2014-01-01  Andhra Pradesh             Ambulance           Others
3  2014 2014-01-01  Andhra Pradesh   Articulated Vehicle           Others
4  2014 2014-01-01  Andhra Pradesh                   Bus              Bus

  Vehicle_Type  EV_Sales_Quantity Month
0       Others                  0    01
1       Others                  0    01
2       Others                  0    01
3       Others                  0    01
4          Bus                  0    01

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96845 entries, 0 to 96844
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Year               96845 non-null  int64
 1   Date               96845 non-null  datetime64[ns]
 2   State              96845 non-null  object
 3   Vehicle_Class      96845 non-null  object
 4   Vehicle_Category   96845 non-null  object
 5   Vehicle_Type       96845 non-null  object
 6   EV_Sales_Quantity  96845 non-null  int64
 7   Month              96845 non-null  object
dtypes: datetime64[ns](1), int64(2), object(5)
memory usage: 5.9+ MB

In [41]:
df.to_csv("clean_ev_sales.csv", index=False)
print("CLEANING COMPLETE. File saved as: clean_ev_sales.csv")

CLEANING COMPLETE. File saved as: clean_ev_sales.csv